Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_NETC_PORT.h
#define NETC_PORT_PCR_PSPEED_MASK                (0x3FFF0000U)
#define NETC_PORT_PCR_PSPEED_SHIFT               (16U)
#define NETC_PORT_PCR_PSPEED(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCR_PSPEED_SHIFT)) & NETC_PORT_PCR_PSPEED_MASK)
/*! @} */

/*! @name PMAR0 - Port MAC address register 0 */
/*! @{ */

#define NETC_PORT_PMAR0_PRIM_MAC_ADDR_MASK       (0xFFFFFFFFU)
#define NETC_PORT_PMAR0_PRIM_MAC_ADDR_SHIFT      (0U)
#define NETC_PORT_PMAR0_PRIM_MAC_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMAR0_PRIM_MAC_ADDR_SHIFT)) & NETC_PORT_PMAR0_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name PMAR1 - Port MAC address register 1 */
/*! @{ */

#define NETC_PORT_PMAR1_PRIM_MAC_ADDR_MASK       (0xFFFFU)
#define NETC_PORT_PMAR1_PRIM_MAC_ADDR_SHIFT      (0U)
#define NETC_PORT_PMAR1_PRIM_MAC_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMAR1_PRIM_MAC_ADDR_SHIFT)) & NETC_PORT_PMAR1_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name PTAR - Port TPID acceptance register */
/*! @{ */

#define NETC_PORT_PTAR_OVTPIDL_MASK              (0xFU)
#define NETC_PORT_PTAR_OVTPIDL_SHIFT             (0U)
#define NETC_PORT_PTAR_OVTPIDL(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTAR_OVTPIDL_SHIFT)) & NETC_PORT_PTAR_OVTPIDL_MASK)

#define NETC_PORT_PTAR_IVTPIDL_MASK              (0xF0U)
#define NETC_PORT_PTAR_IVTPIDL_SHIFT             (4U)
#define NETC_PORT_PTAR_IVTPIDL(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTAR_IVTPIDL_SHIFT)) & NETC_PORT_PTAR_IVTPIDL_MASK)
/*! @} */

/*! @name PQOSMR - Port QoS mode register */
/*! @{ */

#define NETC_PORT_PQOSMR_VS_MASK                 (0x1U)
#define NETC_PORT_PQOSMR_VS_SHIFT                (0U)
#define NETC_PORT_PQOSMR_VS(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOSMR_VS_SHIFT)) & NETC_PORT_PQOSMR_VS_MASK)

#define NETC_PORT_PQOSMR_VE_MASK                 (0x2U)
#define NETC_PORT_PQOSMR_VE_SHIFT                (1U)
#define NETC_PORT_PQOSMR_VE(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOSMR_VE_SHIFT)) & NETC_PORT_PQOSMR_VE_MASK)

#define NETC_PORT_PQOSMR_DDR_MASK                (0xCU)
#define NETC_PORT_PQOSMR_DDR_SHIFT               (2U)
#define NETC_PORT_PQOSMR_DDR(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOSMR_DDR_SHIFT)) & NETC_PORT_PQOSMR_DDR_MASK)

#define NETC_PORT_PQOSMR_DIPV_MASK               (0x70U)
#define NETC_PORT_PQOSMR_DIPV_SHIFT              (4U)
#define NETC_PORT_PQOSMR_DIPV(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOSMR_DIPV_SHIFT)) & NETC_PORT_PQOSMR_DIPV_MASK)

#define NETC_PORT_PQOSMR_VQMP_MASK               (0xF0000U)
#define NETC_PORT_PQOSMR_VQMP_SHIFT              (16U)
/*! VQMP - Mapping profile index */
#define NETC_PORT_PQOSMR_VQMP(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOSMR_VQMP_SHIFT)) & NETC_PORT_PQOSMR_VQMP_MASK)

#define NETC_PORT_PQOSMR_QVMP_MASK               (0xF00000U)
#define NETC_PORT_PQOSMR_QVMP_SHIFT              (20U)
/*! QVMP - Mapping profile index */
#define NETC_PORT_PQOSMR_QVMP(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOSMR_QVMP_SHIFT)) & NETC_PORT_PQOSMR_QVMP_MASK)
/*! @} */

/*! @name PQOR - Port Queue Operational register */
/*! @{ */

#define NETC_PORT_PQOR_Q0S_MASK                  (0x1U)
#define NETC_PORT_PQOR_Q0S_SHIFT                 (0U)
#define NETC_PORT_PQOR_Q0S(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOR_Q0S_SHIFT)) & NETC_PORT_PQOR_Q0S_MASK)

#define NETC_PORT_PQOR_Q1S_MASK                  (0x2U)
#define NETC_PORT_PQOR_Q1S_SHIFT                 (1U)
#define NETC_PORT_PQOR_Q1S(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOR_Q1S_SHIFT)) & NETC_PORT_PQOR_Q1S_MASK)

#define NETC_PORT_PQOR_Q2S_MASK                  (0x4U)
#define NETC_PORT_PQOR_Q2S_SHIFT                 (2U)
#define NETC_PORT_PQOR_Q2S(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOR_Q2S_SHIFT)) & NETC_PORT_PQOR_Q2S_MASK)

#define NETC_PORT_PQOR_Q3S_MASK                  (0x8U)
#define NETC_PORT_PQOR_Q3S_SHIFT                 (3U)
#define NETC_PORT_PQOR_Q3S(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOR_Q3S_SHIFT)) & NETC_PORT_PQOR_Q3S_MASK)

#define NETC_PORT_PQOR_Q4S_MASK                  (0x10U)
#define NETC_PORT_PQOR_Q4S_SHIFT                 (4U)
#define NETC_PORT_PQOR_Q4S(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOR_Q4S_SHIFT)) & NETC_PORT_PQOR_Q4S_MASK)

#define NETC_PORT_PQOR_Q5S_MASK                  (0x20U)
#define NETC_PORT_PQOR_Q5S_SHIFT                 (5U)
#define NETC_PORT_PQOR_Q5S(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOR_Q5S_SHIFT)) & NETC_PORT_PQOR_Q5S_MASK)

#define NETC_PORT_PQOR_Q6S_MASK                  (0x40U)
#define NETC_PORT_PQOR_Q6S_SHIFT                 (6U)
#define NETC_PORT_PQOR_Q6S(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOR_Q6S_SHIFT)) & NETC_PORT_PQOR_Q6S_MASK)

#define NETC_PORT_PQOR_Q7S_MASK                  (0x80U)
#define NETC_PORT_PQOR_Q7S_SHIFT                 (7U)
#define NETC_PORT_PQOR_Q7S(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PQOR_Q7S_SHIFT)) & NETC_PORT_PQOR_Q7S_MASK)
/*! @} */

/*! @name PPCR - Port parser configuration register */
/*! @{ */

#define NETC_PORT_PPCR_L1PFS_MASK                (0x3EU)
#define NETC_PORT_PPCR_L1PFS_SHIFT               (1U)
#define NETC_PORT_PPCR_L1PFS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCR_L1PFS_SHIFT)) & NETC_PORT_PPCR_L1PFS_MASK)

#define NETC_PORT_PPCR_L2PFS_MASK                (0x3E00U)
#define NETC_PORT_PPCR_L2PFS_SHIFT               (9U)
#define NETC_PORT_PPCR_L2PFS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCR_L2PFS_SHIFT)) & NETC_PORT_PPCR_L2PFS_MASK)

#define NETC_PORT_PPCR_L3HFP_MASK                (0x10000U)
#define NETC_PORT_PPCR_L3HFP_SHIFT               (16U)
/*! L3HFP - L3 header fields present
 *  0b0..No L3 header present. Indicates to the parser of not parsing the L3 header. Parsing in this case would go
 *       as far as the L2 header regardless of whether or not there is an L3 header in the frame. This option
 *       should not be used if there are any table lookup entries that contain L3/L4 key fields that could be matched
 *       against a frame.
 *  0b1..Parse L3 header if present in the frame.
 */
#define NETC_PORT_PPCR_L3HFP(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCR_L3HFP_SHIFT)) & NETC_PORT_PPCR_L3HFP_MASK)

#define NETC_PORT_PPCR_L3PFS_MASK                (0x3E0000U)
#define NETC_PORT_PPCR_L3PFS_SHIFT               (17U)
/*! L3PFS - L3 payload fields size in bytes */
#define NETC_PORT_PPCR_L3PFS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCR_L3PFS_SHIFT)) & NETC_PORT_PPCR_L3PFS_MASK)

#define NETC_PORT_PPCR_L4HFP_MASK                (0x1000000U)
#define NETC_PORT_PPCR_L4HFP_SHIFT               (24U)
/*! L4HFP - L4 Header fields present
 *  0b0..No L4 header present. Indicates to the parser of not parsing the L4 header. Parsing in this case would go
 *       as far as the L3 header if configured to parse it (L3HFP=1) regardless of whether or not there is an L4
 *       header in the frame. This option should not be used if there are any table lookup entries that contain L4
 *       key fields that could be matched against a frame.
 *  0b1..Parse L4 header if present in the frame
 */
#define NETC_PORT_PPCR_L4HFP(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCR_L4HFP_SHIFT)) & NETC_PORT_PPCR_L4HFP_MASK)

