Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_NETC_PORT.h
#define NETC_PORT_PTXDCRR0_MSDUEDR_MASK          (0x80U)
#define NETC_PORT_PTXDCRR0_MSDUEDR_SHIFT         (7U)
#define NETC_PORT_PTXDCRR0_MSDUEDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_MSDUEDR_SHIFT)) & NETC_PORT_PTXDCRR0_MSDUEDR_MASK)

#define NETC_PORT_PTXDCRR0_QCONGDR_MASK          (0x100U)
#define NETC_PORT_PTXDCRR0_QCONGDR_SHIFT         (8U)
#define NETC_PORT_PTXDCRR0_QCONGDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_QCONGDR_SHIFT)) & NETC_PORT_PTXDCRR0_QCONGDR_MASK)

#define NETC_PORT_PTXDCRR0_ITEDR_MASK            (0x200U)
#define NETC_PORT_PTXDCRR0_ITEDR_SHIFT           (9U)
#define NETC_PORT_PTXDCRR0_ITEDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_ITEDR_SHIFT)) & NETC_PORT_PTXDCRR0_ITEDR_MASK)

#define NETC_PORT_PTXDCRR0_INVEQDR_MASK          (0x400U)
#define NETC_PORT_PTXDCRR0_INVEQDR_SHIFT         (10U)
#define NETC_PORT_PTXDCRR0_INVEQDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_INVEQDR_SHIFT)) & NETC_PORT_PTXDCRR0_INVEQDR_MASK)

#define NETC_PORT_PTXDCRR0_SQRTNSQDR_MASK        (0x800U)
#define NETC_PORT_PTXDCRR0_SQRTNSQDR_SHIFT       (11U)
#define NETC_PORT_PTXDCRR0_SQRTNSQDR(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_SQRTNSQDR_SHIFT)) & NETC_PORT_PTXDCRR0_SQRTNSQDR_MASK)

#define NETC_PORT_PTXDCRR0_SQRRDR_MASK           (0x2000U)
#define NETC_PORT_PTXDCRR0_SQRRDR_SHIFT          (13U)
#define NETC_PORT_PTXDCRR0_SQRRDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_SQRRDR_SHIFT)) & NETC_PORT_PTXDCRR0_SQRRDR_MASK)

#define NETC_PORT_PTXDCRR0_SQRDDR_MASK           (0x4000U)
#define NETC_PORT_PTXDCRR0_SQRDDR_SHIFT          (14U)
#define NETC_PORT_PTXDCRR0_SQRDDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_SQRDDR_SHIFT)) & NETC_PORT_PTXDCRR0_SQRDDR_MASK)

#define NETC_PORT_PTXDCRR0_SMREDR_MASK           (0x8000U)
#define NETC_PORT_PTXDCRR0_SMREDR_SHIFT          (15U)
#define NETC_PORT_PTXDCRR0_SMREDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_SMREDR_SHIFT)) & NETC_PORT_PTXDCRR0_SMREDR_MASK)
/*! @} */

/*! @name PTXDCRR1 - Port Tx discard count reason register 1 */
/*! @{ */

#define NETC_PORT_PTXDCRR1_ENTRYID_MASK          (0xFFFFU)
#define NETC_PORT_PTXDCRR1_ENTRYID_SHIFT         (0U)
#define NETC_PORT_PTXDCRR1_ENTRYID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR1_ENTRYID_SHIFT)) & NETC_PORT_PTXDCRR1_ENTRYID_MASK)

#define NETC_PORT_PTXDCRR1_TT_MASK               (0xF0000000U)
#define NETC_PORT_PTXDCRR1_TT_SHIFT              (28U)
#define NETC_PORT_PTXDCRR1_TT(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR1_TT_SHIFT)) & NETC_PORT_PTXDCRR1_TT_MASK)
/*! @} */

/*! @name PTGSTCSR - Port time gate scheduling traffic class 0 status register..Port time gate scheduling traffic class 7 status register */
/*! @{ */

#define NETC_PORT_PTGSTCSR_LH_STATE_MASK         (0x10000U)
#define NETC_PORT_PTGSTCSR_LH_STATE_SHIFT        (16U)
#define NETC_PORT_PTGSTCSR_LH_STATE(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGSTCSR_LH_STATE_SHIFT)) & NETC_PORT_PTGSTCSR_LH_STATE_MASK)
/*! @} */

/* The count of NETC_PORT_PTGSTCSR */
#define NETC_PORT_PTGSTCSR_COUNT                 (8U)

/*! @name PTCTMSDUR - Port traffic class 0 transmit maximum SDU register..Port traffic class 7 transmit maximum SDU register */
/*! @{ */

#define NETC_PORT_PTCTMSDUR_MAXSDU_MASK          (0xFFFFU)
#define NETC_PORT_PTCTMSDUR_MAXSDU_SHIFT         (0U)
/*! MAXSDU - Tx Maximum Service Data Unit Size */
#define NETC_PORT_PTCTMSDUR_MAXSDU(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCTMSDUR_MAXSDU_SHIFT)) & NETC_PORT_PTCTMSDUR_MAXSDU_MASK)

#define NETC_PORT_PTCTMSDUR_SDU_TYPE_MASK        (0x30000U)
#define NETC_PORT_PTCTMSDUR_SDU_TYPE_SHIFT       (16U)
/*! SDU_TYPE - SDU type
 *  0b00..PPDU (Physical Layer PDU). Includes preamble, IPG, SFD along with MPDU. The overhead (number of bytes)
 *        to be added to the actual length of each frame, to reflect the PPDU (Physical Layer PDU) frame length, is
 *        specified in the register PTXSDUOR.
 *  0b01..MPDU (MAC PDU). Includes MAC Header, MSDU and FCS. The frame length can be adjusted if a link has MACsec
 *        enabled (such as MACsec enabled in a PHY). The MACsec overhead is specified in register PTXSDUOR.
 *  0b10..MSDU (MAC SDU); MPDU minus 12B MAC Header and 4B FCS. The frame length is adjusted by subtracting 16 bytes from it.
 */
#define NETC_PORT_PTCTMSDUR_SDU_TYPE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCTMSDUR_SDU_TYPE_SHIFT)) & NETC_PORT_PTCTMSDUR_SDU_TYPE_MASK)

#define NETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS_MASK   (0x1000000U)
#define NETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS_SHIFT  (24U)
/*! SF_MAXSDU_DIS
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define NETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS_SHIFT)) & NETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS_MASK)
/*! @} */

/* The count of NETC_PORT_PTCTMSDUR */
#define NETC_PORT_PTCTMSDUR_COUNT                (8U)

/*! @name PTCCBSR0 - Port transmit traffic class 0 credit based shaper register 0..Port transmit traffic class 7 credit based shaper register 0 */
/*! @{ */

#define NETC_PORT_PTCCBSR0_BW_MASK               (0x7FU)
#define NETC_PORT_PTCCBSR0_BW_SHIFT              (0U)
/*! BW - Bandwidth */
#define NETC_PORT_PTCCBSR0_BW(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCCBSR0_BW_SHIFT)) & NETC_PORT_PTCCBSR0_BW_MASK)

#define NETC_PORT_PTCCBSR0_CBSE_MASK             (0x80000000U)
#define NETC_PORT_PTCCBSR0_CBSE_SHIFT            (31U)
/*! CBSE - Credit Based Shaper Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_PORT_PTCCBSR0_CBSE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCCBSR0_CBSE_SHIFT)) & NETC_PORT_PTCCBSR0_CBSE_MASK)
/*! @} */

/* The count of NETC_PORT_PTCCBSR0 */
#define NETC_PORT_PTCCBSR0_COUNT                 (8U)

/*! @name PTCCBSR1 - Port traffic class 0 credit based shaper register 1..Port traffic class 7 credit based shaper register 1 */
/*! @{ */

#define NETC_PORT_PTCCBSR1_HI_CREDIT_MASK        (0xFFFFFFFFU)
#define NETC_PORT_PTCCBSR1_HI_CREDIT_SHIFT       (0U)
/*! HI_CREDIT - hicredit (in credit units) */
#define NETC_PORT_PTCCBSR1_HI_CREDIT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCCBSR1_HI_CREDIT_SHIFT)) & NETC_PORT_PTCCBSR1_HI_CREDIT_MASK)
/*! @} */

